apps/api/load-tests/smoke-test.yml
config:
  target: "http://localhost:4000"
  phases:
    # Quick smoke test: 1 user per second for 1 minute
    - duration: 60
      arrivalRate: 1
      name: "Smoke test"

  ensure:
    maxErrorRate: 0  # Zero errors tolerated in smoke test
    p95: 500  # Fast response times expected

  processor: "./load-tests/processor.js"

scenarios:
  # Critical path smoke test
  - name: "Critical Path Smoke Test"
    flow:
      # 1. Health check
      - get:
          url: "/health"
          expect:
            - statusCode: 200

      # 2. Login
      - post:
          url: "/auth/login"
          json:
            email: "loadtest@wellpulse.io"
            password: "LoadTest123!@#"
          capture:
            - json: "$.accessToken"
              as: "token"
          expect:
            - statusCode: 200

      # 3. List wells
      - get:
          url: "/wells"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

      # 4. Get metrics
      - get:
          url: "/health/metrics"
          expect:
            - statusCode: 200

      # 5. Check performance status
      - get:
          url: "/health/performance"
          expect:
            - statusCode: 200